trezor/trezor-firmware/core/embed/sys/syscall/stm32/syscall_dispatch.c
/*
 * This file is part of the Trezor project, https://trezor.io/
 *
 * Copyright (c) SatoshiLabs
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

#ifdef KERNEL

#include <trezor_rtl.h>

#include <gfx/dma2d_bitblt.h>
#include <io/display.h>
#include <io/usb.h>
#include <io/usb_hid.h>
#include <io/usb_vcp.h>
#include <io/usb_webusb.h>
#include <sec/entropy.h>
#include <sec/rng.h>
#include <sec/secret.h>
#include <sys/bootutils.h>
#include <sys/irq.h>
#include <sys/sysevent.h>
#include <sys/systask.h>
#include <sys/system.h>
#include <sys/systick.h>
#include <util/fwutils.h>
#include <util/translations.h>
#include <util/unit_properties.h>

#ifdef USE_BLE
#include <io/ble.h>
#endif

#ifdef USE_NRF
#include <io/nrf.h>
#endif

#ifdef USE_BUTTON
#include <io/button.h>
#endif

#ifdef USE_HAPTIC
#include <io/haptic.h>
#endif

#ifdef USE_HW_JPEG_DECODER
#include <gfx/jpegdec.h>
#endif

#ifdef USE_OPTIGA
#include <sec/optiga.h>
#endif

#ifdef USE_POWER_MANAGER
#include <sys/power_manager.h>
#endif

#ifdef USE_RGB_LED
#include <io/rgb_led.h>
#endif

#ifdef USE_SD_CARD
#include <io/sdcard.h>
#endif

#ifdef USE_TOUCH
#include <io/touch.h>
#endif

#if PRODUCTION || BOOTLOADER_QA
#include <util/boot_image.h>
#endif

#include "syscall_context.h"
#include "syscall_internal.h"
#include "syscall_verifiers.h"

static PIN_UI_WAIT_CALLBACK storage_init_callback = NULL;

static secbool storage_init_callback_wrapper(
    uint32_t wait, uint32_t progress, enum storage_ui_message_t message) {
  secbool result;

  applet_t *applet = syscall_get_context();
  result = systask_invoke_callback(&applet->task, wait, progress, message,
                                   storage_init_callback);
  return result;
}

__attribute((no_stack_protector)) void syscall_handler(uint32_t *args,
                                                       uint32_t syscall,
                                                       void *applet) {
  syscall_set_context((applet_t *)applet);

  switch (syscall) {
    case SYSCALL_RETURN_FROM_CALLBACK: {
      syscall_get_context()->task.in_callback = false;
      systask_yield_to(systask_kernel());
      break;
    }

    case SYSCALL_SYSTEM_EXIT: {
      int exit_code = (int)args[0];
      system_exit__verified(exit_code);
    } break;

    case SYSCALL_SYSTEM_EXIT_ERROR: {
      const char *title = (const char *)args[0];
      size_t title_len = (size_t)args[1];
      const char *message = (const char *)args[2];
      size_t message_len = (size_t)args[3];
      const char *footer = (const char *)args[4];
      size_t footer_len = (size_t)args[5];
      system_exit_error__verified(title, title_len, message, message_len,
                                  footer, footer_len);
    } break;

    case SYSCALL_SYSTEM_EXIT_FATAL: {
      const char *message = (const char *)args[0];
      size_t message_len = (size_t)args[1];
      const char *file = (const char *)args[2];
      size_t file_len = (size_t)args[3];
      int line = (int)args[4];
      system_exit_fatal__verified(message, message_len, file, file_len, line);
    } break;

    case SYSCALL_SYSTICK_CYCLES: {
      uint64_t cycles = systick_cycles();
      args[0] = cycles & 0xFFFFFFFF;
      args[1] = cycles >> 32;
    } break;

    case SYSCALL_SYSTICK_US: {
      uint64_t cycles = systick_us();
      args[0] = cycles & 0xFFFFFFFF;
      args[1] = cycles >> 32;
    } break;

    case SYSCALL_SYSTICK_MS: {
      args[0] = systick_ms();
    } break;

    case SYSCALL_SYSTICK_US_TO_CYCLES: {
      uint64_t us = args[0] + ((uint64_t)args[1] << 32);
      uint64_t cycles = systick_us_to_cycles(us);
      args[0] = cycles & 0xFFFFFFFF;
      args[1] = cycles >> 32;
    } break;

    case SYSCALL_SYSEVENTS_POLL: {
      const sysevents_t *awaited = (sysevents_t *)args[0];
      sysevents_t *signalled = (sysevents_t *)args[1];
      uint32_t deadline = args[2];
      if (!syscall_get_context()->task.in_callback) {
        sysevents_poll__verified(awaited, signalled, deadline);
      }
    } break;

    case SYSCALL_BOOT_IMAGE_CHECK: {
      const boot_image_t *image = (const boot_image_t *)args[0];
      args[0] = boot_image_check__verified(image);
    } break;

    case SYSCALL_BOOT_IMAGE_REPLACE: {
      const boot_image_t *image = (const boot_image_t *)args[0];
      boot_image_replace__verified(image);
    } break;

    case SYSCALL_REBOOT_DEVICE: {
      reboot_device();
    } break;

    case SYSCALL_REBOOT_TO_BOOTLOADER: {
      reboot_to_bootloader();
    } break;

    case SYSCALL_REBOOT_AND_UPGRADE: {
      const uint8_t *hash = (const uint8_t *)args[0];
      reboot_and_upgrade__verified(hash);
    } break;

    case SYSCALL_DISPLAY_SET_BACKLIGHT: {
      int level = (int)args[0];
      args[0] = display_set_backlight(level);
    } break;

    case SYSCALL_DISPLAY_GET_BACKLIGHT: {
      args[0] = display_get_backlight();
    } break;

    case SYSCALL_DISPLAY_SET_ORIENTATION: {
      int angle = (int)args[0];
      args[0] = display_set_orientation(angle);
    } break;

    case SYSCALL_DISPLAY_GET_ORIENTATION: {
      args[0] = display_get_orientation();
    } break;

#if FRAMEBUFFER
    case SYSCALL_DISPLAY_GET_FB_INFO: {
      display_fb_info_t *fb = (display_fb_info_t *)args[0];
      args[0] = (uint32_t)display_get_frame_buffer__verified(fb);
    } break;
#else
    case SYSCALL_DISPLAY_WAIT_FOR_SYNC: {
      display_wait_for_sync();
    } break;
#endif

    case SYSCALL_DISPLAY_FILL: {
      const gfx_bitblt_t *bb = (const gfx_bitblt_t *)args[0];
      display_fill__verified(bb);
    } break;

#ifdef USE_RGB_COLORS
    case SYSCALL_DISPLAY_COPY_RGB565: {
      const gfx_bitblt_t *bb = (const gfx_bitblt_t *)args[0];
      display_copy_rgb565__verified(bb);
    } break;
#endif

