trezor/trezor-firmware/core/embed/sys/syscall/stm32/syscall_dispatch.c
    case SYSCALL_DISPLAY_REFRESH: {
      display_refresh();
    } break;

    case SYSCALL_USB_INIT: {
      const usb_dev_info_t *dev_info = (const usb_dev_info_t *)args[0];
      args[0] = usb_init(dev_info);
    } break;

    case SYSCALL_USB_DEINIT: {
      usb_deinit();
    } break;

    case SYSCALL_USB_START: {
      args[0] = usb_start();
    } break;

    case SYSCALL_USB_STOP: {
      usb_stop();
    } break;

    case SYSCALL_USB_GET_EVENT: {
      args[0] = usb_get_event();
    } break;

    case SYSCALL_USB_GET_STATE: {
      usb_state_t *state = (usb_state_t *)args[0];
      usb_get_state__verified(state);
    } break;

    case SYSCALL_USB_HID_ADD: {
      const usb_hid_info_t *hid_info = (const usb_hid_info_t *)args[0];
      args[0] = usb_hid_add(hid_info);
    } break;

    case SYSCALL_USB_HID_CAN_READ: {
      uint8_t iface_num = (uint8_t)args[0];
      args[0] = usb_hid_can_read(iface_num);
    } break;

    case SYSCALL_USB_HID_CAN_WRITE: {
      uint8_t iface_num = (uint8_t)args[0];
      args[0] = usb_hid_can_write(iface_num);
    } break;

    case SYSCALL_USB_HID_READ: {
      uint8_t iface_num = (uint8_t)args[0];
      uint8_t *buf = (uint8_t *)args[1];
      uint32_t len = args[2];
      args[0] = usb_hid_read__verified(iface_num, buf, len);
    } break;

    case SYSCALL_USB_HID_WRITE: {
      uint8_t iface_num = (uint8_t)args[0];
      const uint8_t *buf = (const uint8_t *)args[1];
      uint32_t len = args[2];
      args[0] = usb_hid_write__verified(iface_num, buf, len);
    } break;

    case SYSCALL_USB_HID_READ_SELECT: {
      uint32_t timeout = args[0];
      args[0] = usb_hid_read_select(timeout);
    } break;

    case SYSCALL_USB_HID_READ_BLOCKING: {
      uint8_t iface_num = (uint8_t)args[0];
      uint8_t *buf = (uint8_t *)args[1];
      uint32_t len = args[2];
      int timeout = (int)args[3];
      args[0] = usb_hid_read_blocking__verified(iface_num, buf, len, timeout);
    } break;

    case SYSCALL_USB_HID_WRITE_BLOCKING: {
      uint8_t iface_num = (uint8_t)args[0];
      const uint8_t *buf = (const uint8_t *)args[1];
      uint32_t len = args[2];
      int timeout = (int)args[3];
      args[0] = usb_hid_write_blocking__verified(iface_num, buf, len, timeout);
    } break;

    case SYSCALL_USB_VCP_ADD: {
      const usb_vcp_info_t *vcp_info = (const usb_vcp_info_t *)args[0];
      args[0] = usb_vcp_add(vcp_info);
    } break;

    case SYSCALL_USB_VCP_CAN_READ: {
      uint8_t iface_num = (uint8_t)args[0];
      args[0] = usb_vcp_can_read(iface_num);
    } break;

    case SYSCALL_USB_VCP_CAN_WRITE: {
      uint8_t iface_num = (uint8_t)args[0];
      args[0] = usb_vcp_can_write(iface_num);
    } break;

    case SYSCALL_USB_VCP_READ: {
      uint8_t iface_num = (uint8_t)args[0];
      uint8_t *buf = (uint8_t *)args[1];
      uint32_t len = args[2];
      args[0] = usb_vcp_read__verified(iface_num, buf, len);
    } break;

    case SYSCALL_USB_VCP_WRITE: {
      uint8_t iface_num = (uint8_t)args[0];
      const uint8_t *buf = (const uint8_t *)args[1];
      uint32_t len = args[2];
      args[0] = usb_vcp_write__verified(iface_num, buf, len);
    } break;

    case SYSCALL_USB_VCP_READ_BLOCKING: {
      uint8_t iface_num = (uint8_t)args[0];
      uint8_t *buf = (uint8_t *)args[1];
      uint32_t len = args[2];
      int timeout = (int)args[3];
      args[0] = usb_vcp_read_blocking__verified(iface_num, buf, len, timeout);
    } break;

    case SYSCALL_USB_VCP_WRITE_BLOCKING: {
      uint8_t iface_num = (uint8_t)args[0];
      const uint8_t *buf = (const uint8_t *)args[1];
      uint32_t len = args[2];
      int timeout = (int)args[3];
      args[0] = usb_vcp_write_blocking__verified(iface_num, buf, len, timeout);
    } break;

    case SYSCALL_USB_WEBUSB_ADD: {
      const usb_webusb_info_t *webusb_info = (const usb_webusb_info_t *)args[0];
      args[0] = usb_webusb_add(webusb_info);
    } break;

    case SYSCALL_USB_WEBUSB_CAN_READ: {
      uint8_t iface_num = (uint8_t)args[0];
      args[0] = usb_webusb_can_read(iface_num);
    } break;

    case SYSCALL_USB_WEBUSB_CAN_WRITE: {
      uint8_t iface_num = (uint8_t)args[0];
      args[0] = usb_webusb_can_write(iface_num);
    } break;

    case SYSCALL_USB_WEBUSB_READ: {
      uint8_t iface_num = (uint8_t)args[0];
      uint8_t *buf = (uint8_t *)args[1];
      uint32_t len = args[2];
      args[0] = usb_webusb_read__verified(iface_num, buf, len);
    } break;

    case SYSCALL_USB_WEBUSB_WRITE: {
      uint8_t iface_num = (uint8_t)args[0];
      const uint8_t *buf = (const uint8_t *)args[1];
      uint32_t len = args[2];
      args[0] = usb_webusb_write__verified(iface_num, buf, len);
    } break;

    case SYSCALL_USB_WEBUSB_READ_SELECT: {
      uint32_t timeout = args[0];
      args[0] = usb_webusb_read_select(timeout);
    } break;

    case SYSCALL_USB_WEBUSB_READ_BLOCKING: {
      uint8_t iface_num = (uint8_t)args[0];
      uint8_t *buf = (uint8_t *)args[1];
      uint32_t len = args[2];
      int timeout = (int)args[3];
      args[0] =
          usb_webusb_read_blocking__verified(iface_num, buf, len, timeout);
    } break;

    case SYSCALL_USB_WEBUSB_WRITE_BLOCKING: {
      uint8_t iface_num = (uint8_t)args[0];
      const uint8_t *buf = (const uint8_t *)args[1];
      uint32_t len = args[2];
      int timeout = (int)args[3];
      args[0] =
          usb_webusb_write_blocking__verified(iface_num, buf, len, timeout);
    } break;

#ifdef USE_SD_CARD
    case SYSCALL_SDCARD_POWER_ON: {
      args[0] = sdcard_power_on();
    } break;

    case SYSCALL_SDCARD_POWER_OFF: {
      sdcard_power_off();
    } break;

    case SYSCALL_SDCARD_IS_PRESENT: {
      args[0] = sdcard_is_present();
    } break;

    case SYSCALL_SDCARD_GET_CAPACITY: {
      args[0] = sdcard_get_capacity_in_bytes();
    } break;

    case SYSCALL_SDCARD_READ_BLOCKS: {
      uint32_t *dest = (uint32_t *)args[0];
      uint32_t block_num = args[1];
      uint32_t num_blocks = args[2];
      args[0] = sdcard_read_blocks__verified(dest, block_num, num_blocks);
    } break;

    case SYSCALL_SDCARD_WRITE_BLOCKS: {
      const uint32_t *src = (const uint32_t *)args[0];
      uint32_t block_num = args[1];
      uint32_t num_blocks = args[2];
      args[0] = sdcard_write_blocks__verified(src, block_num, num_blocks);
    } break;
#endif

    case SYSCALL_UNIT_PROPERTIES_GET: {
      unit_properties_t *props = (unit_properties_t *)args[0];
      unit_properties_get__verified(props);
    } break;

#ifdef LOCKABLE_BOOTLOADER
    case SYSCALL_SECRET_BOOTLOADER_LOCKED: {
      args[0] = secret_bootloader_locked();
    } break;
#endif

#ifdef USE_BUTTON
    case SYSCALL_BUTTON_GET_EVENT: {
      button_event_t *event = (button_event_t *)args[0];
      args[0] = button_get_event__verified(event);
    } break;
#endif

#ifdef USE_TOUCH
    case SYSCALL_TOUCH_GET_EVENT: {
      args[0] = touch_get_event();
    } break;
#endif

#ifdef USE_RGB_LED
    case SYSCALL_RGB_LED_SET_COLOR: {
      uint32_t color = args[0];
      rgb_led_set_color(color);
    } break;
#endif

#ifdef USE_HAPTIC
    case SYSCALL_HAPTIC_SET_ENABLED: {
      bool enabled = (args[0] != 0);
      haptic_set_enabled(enabled);
    } break;

