trezor/trezor-firmware/core/embed/sys/syscall/stm32/syscall_dispatch.c
    case SYSCALL_HAPTIC_GET_ENABLED: {
      args[0] = haptic_get_enabled();
    } break;

    case SYSCALL_HAPTIC_TEST: {
      uint16_t duration_ms = (uint16_t)args[0];
      args[0] = haptic_test(duration_ms);
    } break;

    case SYSCALL_HAPTIC_PLAY: {
      haptic_effect_t effect = (haptic_effect_t)args[0];
      args[0] = haptic_play(effect);
    } break;

    case SYSCALL_HAPTIC_PLAY_CUSTOM: {
      int8_t amplitude_pct = (int8_t)args[0];
      uint16_t duration_ms = (uint16_t)args[1];
      args[0] = haptic_play_custom(amplitude_pct, duration_ms);
    } break;
#endif

#ifdef USE_OPTIGA
    case SYSCALL_OPTIGA_SIGN: {
      uint8_t index = args[0];
      const uint8_t *digest = (const uint8_t *)args[1];
      size_t digest_size = args[2];
      uint8_t *signature = (uint8_t *)args[3];
      size_t max_sig_size = args[4];
      size_t *sig_size = (size_t *)args[5];
      args[0] = optiga_sign__verified(index, digest, digest_size, signature,
                                      max_sig_size, sig_size);
    } break;

    case SYSCALL_OPTIGA_CERT_SIZE: {
      uint8_t index = args[0];
      size_t *cert_size = (size_t *)args[1];
      args[0] = optiga_cert_size__verified(index, cert_size);
    } break;

    case SYSCALL_OPTIGA_READ_CERT: {
      uint8_t index = args[0];
      uint8_t *cert = (uint8_t *)args[1];
      size_t max_cert_size = args[2];
      size_t *cert_size = (size_t *)args[3];
      args[0] =
          optiga_read_cert__verified(index, cert, max_cert_size, cert_size);
    } break;

    case SYSCALL_OPTIGA_READ_SEC: {
      uint8_t *sec = (uint8_t *)args[0];
      args[0] = optiga_read_sec__verified(sec);
    } break;

    case SYSCALL_OPTIGA_RANDOM_BUFFER: {
      uint8_t *dest = (uint8_t *)args[0];
      size_t size = args[1];
      args[0] = optiga_random_buffer__verified(dest, size);
    } break;

#if PYOPT == 0
    case SYSCALL_OPTIGA_SET_SEC_MAX: {
      optiga_set_sec_max();
    } break;
#endif
#endif

    case SYSCALL_STORAGE_INIT: {
      storage_init_callback = (PIN_UI_WAIT_CALLBACK)args[0];
      const uint8_t *salt = (const uint8_t *)args[1];
      uint16_t salt_len = args[2];
      storage_init__verified(storage_init_callback_wrapper, salt, salt_len);
    } break;

    case SYSCALL_STORAGE_WIPE: {
      storage_wipe();
    } break;

    case SYSCALL_STORAGE_IS_UNLOCKED: {
      args[0] = storage_is_unlocked();
    } break;

    case SYSCALL_STORAGE_LOCK: {
      storage_lock();
    } break;

    case SYSCALL_STORAGE_UNLOCK: {
      const uint8_t *pin = (const uint8_t *)args[0];
      size_t pin_len = args[1];
      const uint8_t *ext_salt = (const uint8_t *)args[2];
      args[0] = storage_unlock__verified(pin, pin_len, ext_salt);
    } break;

    case SYSCALL_STORAGE_HAS_PIN: {
      args[0] = storage_has_pin();
    } break;

    case SYSCALL_STORAGE_PIN_FAILS_INCREASE: {
      args[0] = storage_pin_fails_increase();
    } break;

    case SYSCALL_STORAGE_GET_PIN_REM: {
      args[0] = storage_get_pin_rem();
    } break;

    case SYSCALL_STORAGE_CHANGE_PIN: {
      const uint8_t *oldpin = (const uint8_t *)args[0];
      size_t oldpin_len = args[1];
      const uint8_t *newpin = (const uint8_t *)args[2];
      size_t newpin_len = args[3];
      const uint8_t *old_ext_salt = (const uint8_t *)args[4];
      const uint8_t *new_ext_salt = (const uint8_t *)args[5];
      args[0] = storage_change_pin__verified(
          oldpin, oldpin_len, newpin, newpin_len, old_ext_salt, new_ext_salt);
    } break;

    case SYSCALL_STORAGE_ENSURE_NOT_WIPE_CODE: {
      const uint8_t *pin = (const uint8_t *)args[0];
      size_t pin_len = args[1];
      storage_ensure_not_wipe_code__verified(pin, pin_len);
    } break;

    case SYSCALL_STORAGE_HAS_WIPE_CODE: {
      args[0] = storage_has_wipe_code();
    } break;

    case SYSCALL_STORAGE_CHANGE_WIPE_CODE: {
      const uint8_t *pin = (const uint8_t *)args[0];
      size_t pin_len = args[1];
      const uint8_t *ext_salt = (const uint8_t *)args[2];
      const uint8_t *wipe_code = (const uint8_t *)args[3];
      size_t wipe_code_len = args[4];
      args[0] = storage_change_wipe_code__verified(pin, pin_len, ext_salt,
                                                   wipe_code, wipe_code_len);
    } break;

    case SYSCALL_STORAGE_HAS: {
      uint16_t key = (uint16_t)args[0];
      args[0] = storage_has(key);
    } break;

    case SYSCALL_STORAGE_GET: {
      uint16_t key = (uint16_t)args[0];
      void *val = (void *)args[1];
      uint16_t max_len = (uint16_t)args[2];
      uint16_t *len = (uint16_t *)args[3];
      args[0] = storage_get__verified(key, val, max_len, len);
    } break;

    case SYSCALL_STORAGE_SET: {
      uint16_t key = (uint16_t)args[0];
      const void *val = (const void *)args[1];
      uint16_t len = (uint16_t)args[2];
      args[0] = storage_set__verified(key, val, len);
    } break;

    case SYSCALL_STORAGE_DELETE: {
      uint16_t key = (uint16_t)args[0];
      args[0] = storage_delete(key);
    } break;

    case SYSCALL_STORAGE_SET_COUNTER: {
      uint16_t key = (uint16_t)args[0];
      uint32_t count = args[1];
      args[0] = storage_set_counter(key, count);
    } break;

    case SYSCALL_STORAGE_NEXT_COUNTER: {
      uint16_t key = (uint16_t)args[0];
      uint32_t *count = (uint32_t *)args[1];
      args[0] = storage_next_counter__verified(key, count);
    } break;

    case SYSCALL_ENTROPY_GET: {
      entropy_data_t *entropy = (entropy_data_t *)args[0];
      entropy_get__verified(entropy);
    } break;

    case SYSCALL_TRANSLATIONS_WRITE: {
      const uint8_t *data = (const uint8_t *)args[0];
      uint32_t offset = args[1];
      uint32_t len = args[2];
      args[0] = translations_write(data, offset, len);
    } break;

    case SYSCALL_TRANSLATIONS_READ: {
      uint32_t *len = (uint32_t *)args[0];
      uint32_t offset = args[1];
      args[0] = (uint32_t)translations_read(len, offset);
    } break;

    case SYSCALL_TRANSLATIONS_ERASE: {
      translations_erase();
    } break;

    case SYSCALL_TRANSLATIONS_AREA_BYTESIZE: {
      args[0] = translations_area_bytesize();
    } break;

    case SYSCALL_RNG_GET: {
      args[0] = rng_get();
    } break;

