trezor/trezor-firmware/core/embed/sys/syscall/stm32/syscall_dispatch.c
    case SYSCALL_FIRMWARE_GET_VENDOR: {
      char *buff = (char *)args[0];
      size_t buff_size = args[1];
      args[0] = firmware_get_vendor__verified(buff, buff_size);
    } break;

    case SYSCALL_FIRMWARE_HASH_START: {
      const uint8_t *challenge = (const uint8_t *)args[0];
      size_t challenge_len = args[1];
      args[0] = firmware_hash_start__verified(challenge, challenge_len);
    } break;

    case SYSCALL_FIRMWARE_HASH_CONTINUE: {
      uint8_t *hash = (uint8_t *)args[0];
      size_t hash_len = args[1];
      args[0] = firmware_hash_continue__verified(hash, hash_len);
    } break;

#ifdef USE_BLE
    case SYSCALL_BLE_START: {
      ble_start();
    } break;

    case SYSCALL_BLE_ISSUE_COMMAND: {
      ble_command_t *command = (ble_command_t *)args[0];
      args[0] = ble_issue_command__verified(command);
    } break;

    case SYSCALL_BLE_GET_STATE: {
      ble_state_t *state = (ble_state_t *)args[0];
      ble_get_state__verified(state);
    } break;

    case SYSCALL_BLE_GET_EVENT: {
      ble_event_t *event = (ble_event_t *)args[0];
      args[0] = ble_get_event__verified(event);
    } break;

    case SYSCALL_BLE_CAN_WRITE: {
      args[0] = ble_can_write();
    } break;

    case SYSCALL_BLE_WRITE: {
      uint8_t *data = (uint8_t *)args[0];
      size_t len = args[1];
      args[0] = ble_write__verified(data, len);
    } break;

    case SYSCALL_BLE_CAN_READ: {
      args[0] = ble_can_read();
    } break;

    case SYSCALL_BLE_READ: {
      uint8_t *data = (uint8_t *)args[0];
      size_t len = args[1];
      args[0] = ble_read__verified(data, len);
    } break;
#endif

#ifdef USE_NRF

    case SYSCALL_NRF_UPDATE_REQUIRED: {
      const uint8_t *data = (const uint8_t *)args[0];
      size_t len = args[1];
      args[0] = nrf_update_required__verified(data, len);
    } break;

    case SYSCALL_NRF_UPDATE: {
      const uint8_t *data = (const uint8_t *)args[0];
      size_t len = args[1];
      args[0] = nrf_update__verified(data, len);
    } break;

#endif

#ifdef USE_POWER_MANAGER
    case SYSCALL_POWER_MANAGER_SUSPEND: {
      wakeup_flags_t *wakeup_flags = (wakeup_flags_t *)args[0];
      args[0] = pm_suspend__verified(wakeup_flags);
    } break;

    case SYSCALL_POWER_MANAGER_HIBERNATE: {
      args[0] = pm_hibernate();
    } break;

    case SYSCALL_POWER_MANAGER_GET_STATE: {
      pm_state_t *status = (pm_state_t *)args[0];
      args[0] = pm_get_state__verified(status);
    } break;

    case SYSCALL_POWER_MANAGER_GET_EVENTS: {
      pm_event_t *status = (pm_event_t *)args[0];
      args[0] = pm_get_events__verified(status);
    } break;
#endif

#ifdef USE_HW_JPEG_DECODER
    case SYSCALL_JPEGDEC_OPEN: {
      args[0] = jpegdec_open();
    } break;

    case SYSCALL_JPEGDEC_CLOSE: {
      jpegdec_close();
    } break;

    case SYSCALL_JPEGDEC_PROCESS: {
      args[0] = jpegdec_process__verified((jpegdec_input_t *)args[0]);
    } break;

    case SYSCALL_JPEGDEC_GET_INFO: {
      args[0] = jpegdec_get_info__verified((jpegdec_image_t *)args[0]);
      break;
    }

    case SYSCALL_JPEGDEC_GET_SLICE_RGBA8888: {
      args[0] = jpegdec_get_slice_rgba8888__verified(
          (void *)args[0], (jpegdec_slice_t *)args[1]);
      break;
    }

    case SYSCALL_JPEGDEC_GET_SLICE_MONO8: {
      args[0] = jpegdec_get_slice_mono8__verified((void *)args[0],
                                                  (jpegdec_slice_t *)args[1]);
      break;
    }
#endif  // USE_HW_JPEG_DECODER

#ifdef USE_DMA2D
    case SYSCALL_DMA2D_WAIT: {
      dma2d_wait();
    } break;

    case SYSCALL_DMA2D_RGB565_FILL: {
      const gfx_bitblt_t *bb = (const gfx_bitblt_t *)args[0];
      args[0] = dma2d_rgb565_fill__verified(bb);
    } break;

    case SYSCALL_DMA2D_RGB565_COPY_MONO4: {
      const gfx_bitblt_t *bb = (const gfx_bitblt_t *)args[0];
      args[0] = dma2d_rgb565_copy_mono4__verified(bb);
    } break;

    case SYSCALL_DMA2D_RGB565_COPY_RGB565: {
      const gfx_bitblt_t *bb = (const gfx_bitblt_t *)args[0];
      args[0] = dma2d_rgb565_copy_rgb565__verified(bb);
    } break;

    case SYSCALL_DMA2D_RGB565_BLEND_MONO4: {
      const gfx_bitblt_t *bb = (const gfx_bitblt_t *)args[0];
      args[0] = dma2d_rgb565_blend_mono4__verified(bb);
    } break;

    case SYSCALL_DMA2D_RGB565_BLEND_MONO8: {
      const gfx_bitblt_t *bb = (const gfx_bitblt_t *)args[0];
      args[0] = dma2d_rgb565_blend_mono8__verified(bb);
    } break;

    case SYSCALL_DMA2D_RGBA8888_FILL: {
      const gfx_bitblt_t *bb = (const gfx_bitblt_t *)args[0];
      args[0] = dma2d_rgba8888_fill__verified(bb);
    } break;

    case SYSCALL_DMA2D_RGBA8888_COPY_MONO4: {
      const gfx_bitblt_t *bb = (const gfx_bitblt_t *)args[0];
      args[0] = dma2d_rgba8888_copy_mono4__verified(bb);
    } break;

    case SYSCALL_DMA2D_RGBA8888_COPY_RGB565: {
      const gfx_bitblt_t *bb = (const gfx_bitblt_t *)args[0];
      args[0] = dma2d_rgba8888_copy_rgb565__verified(bb);
    } break;

    case SYSCALL_DMA2D_RGBA8888_COPY_RGBA8888: {
      const gfx_bitblt_t *bb = (const gfx_bitblt_t *)args[0];
      args[0] = dma2d_rgba8888_copy_rgba8888__verified(bb);
    } break;

    case SYSCALL_DMA2D_RGBA8888_BLEND_MONO4: {
      const gfx_bitblt_t *bb = (const gfx_bitblt_t *)args[0];
      args[0] = dma2d_rgba8888_blend_mono4__verified(bb);
    } break;

    case SYSCALL_DMA2D_RGBA8888_BLEND_MONO8: {
      const gfx_bitblt_t *bb = (const gfx_bitblt_t *)args[0];
      args[0] = dma2d_rgba8888_blend_mono8__verified(bb);
    } break;
#endif  // USE_DMA2D

#ifdef USE_TROPIC
    case SYSCALL_TROPIC_PING: {
      const uint8_t *msg_out = (const uint8_t *)args[0];
      uint8_t *msg_in = (uint8_t *)args[1];
      uint16_t msg_len = (uint16_t)args[2];
      args[0] = tropic_ping__verified(msg_out, msg_in, msg_len);
    } break;

    case SYSCALL_TROPIC_GET_CERT: {
      uint8_t *buf = (uint8_t *)args[0];
      uint16_t buf_size = (uint16_t)args[1];
      args[0] = tropic_get_cert__verified(buf, buf_size);
    } break;
    case SYSCALL_TROPIC_ECC_KEY_GENERATE: {
      uint16_t slot_index = (uint16_t)args[0];
      args[0] = tropic_ecc_key_generate__verified(slot_index);

    } break;
    case SYSCALL_TROPIC_ECC_SIGN: {
      uint16_t key_slot_index = (uint16_t)args[0];
      const uint8_t *dig = (const uint8_t *)args[1];
      uint16_t dig_len = (uint16_t)args[2];
      uint8_t *sig = (uint8_t *)args[3];
      uint16_t sig_len = (uint16_t)args[4];

      args[0] =
          tropic_ecc_sign__verified(key_slot_index, dig, dig_len, sig, sig_len);

    } break;
#endif

    default:
      system_exit_fatal("Invalid syscall", __FILE__, __LINE__);
      break;
  }
}

#endif  // KERNEL
